TJ215702/stm8/main.c
/* MAIN.C file
 * 
 * Copyright (c) 2002-2005 STMicroelectronics
 */
#include "stm8s.h"
#include "stm8s_conf.h"
#include "uart.h"
#include "rc522.h"
#include "lf_send.h"
#include <string.h>


unsigned char RFFull = 0;
unsigned char RFBit;
unsigned char LL_w = 0;
unsigned char First_flag = 0;
unsigned char Buff_B[8];
unsigned char RF_UartSend[10];
unsigned char secure_key[10];
u8 RF_set=0;
unsigned char BitCount;
unsigned char Time_1ms = 0;

/* Key cache in RAM (loaded from EEPROM before halt) */
uint8_t cached_key_count = 0;
uint8_t cached_keys[5][16];  // 5 x 16 bytes

#define RF_LEN       64
const uint8_t Secret_Key[8] = {0x12, 0x34, 0x56, 0x78, 0x9A, 0xBC, 0xDE, 0xF0};


void RF_Remote(uint8_t);

enum pke_oper_state {
    PKE_OPER_STA_POWER_OFF,
    PKE_OPER_STA_POWER_ON,
    PKE_OPER_STA_WAIT,
    PKE_OPER_STA_IDLE,
    PKE_OPER_STA_LEARN,
    PKE_OPER_STA_BUSY,
    PKE_OPER_STA_ERROR
};

volatile struct PKE_config {
    uint8_t key_num;
    uint8_t rc522_num;
    volatile uint8_t oper_state;
    volatile uint8_t power_event_flag;
    volatile uint8_t learn_event_flag;
} TJTW_PKE;

#define BR_LIGHT_ON()      GPIO_WriteHigh(GPIOD, GPIO_PIN_3)
#define BR_LIGHT_OFF()     GPIO_WriteLow(GPIOD, GPIO_PIN_3)

#define BZ_ON()      GPIO_WriteHigh(GPIOB, GPIO_PIN_1)
#define BZ_OFF()     GPIO_WriteLow(GPIOB, GPIO_PIN_1)

#define LP_RIGHT_ON()      GPIO_WriteHigh(GPIOB, GPIO_PIN_3)
#define LP_RIGHT_OFF()     GPIO_WriteLow(GPIOB, GPIO_PIN_3)

#define MOTOR2_ON()     GPIO_WriteHigh(GPIOC, GPIO_PIN_2)
#define MOTOR2_OFF()    GPIO_WriteLow(GPIOC, GPIO_PIN_2)

#define MOTOR1_ON()     GPIO_WriteHigh(GPIOB, GPIO_PIN_0)
#define MOTOR1_OFF()    GPIO_WriteLow(GPIOB, GPIO_PIN_0)

#define MOTOR_FWD()  do{MOTOR1_ON(); MOTOR2_OFF();}while(0)
#define MOTOR_REV()  do{MOTOR1_OFF(); MOTOR2_ON();}while(0)
#define MOTOR_STOP() do{MOTOR1_OFF(); MOTOR2_OFF();}while(0)

#define RF_DATA_LOW()        (GPIO_ReadInputPin(GPIOD, GPIO_PIN_0) == RESET)   //RESET=0

#define KEY_BLOCK_SIZE       16    // 4 (RFID) + 8 (full Buff_B, include CRC) + 2 (wake up)
#define MAX_KEY_NUM          5
#define KEY_DATA_START_ADDR  0x00004110
#define KEY_COUNT_ADDR       0x00004100

//for ign to count down by 10s
#define IGN_TIMEOUT_MS      10000UL
#define IGN_IS_ON()         (GPIO_ReadInputPin(GPIOB, GPIO_PIN_5) != RESET)  //SET=1
#define IGN_detect()         GPIO_ReadInputPin(GPIOB, GPIO_PIN_5)

#define MCU_REG_NUM      26
const uint8_t mcu_user_config[MCU_REG_NUM] =
{
    0xA5,0x5A,0x01,0x7D,0x80,0x00,0x00,0x01,
    0xC3,0x3A,0x0C,0x01,0x00,0x15,0x00,0x01,
    0x01,0x81,0x32,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,
};

u8 Tx_Buffer[] = "RFID---test";
#define  BufferSize (countof(Tx_Buffer)-1)

uint16_t Calculate_CRC16(uint8_t *ptr, uint8_t len, uint8_t ran) {
    uint16_t crc = 0xFFFF;
    uint8_t i, j;
    if (ran == 1)
        crc = 0xFFFF;
    else if (ran == 2)
        crc = 0x1234;

    for (i = 0; i < len; i++) {
        crc ^= (uint16_t)ptr[i] << 8;
        for (j = 0; j < 8; j++) {
            if (crc & 0x8000) {
                crc = (crc << 1) ^ 0x1021;
            } else {
                crc <<= 1;
            }
        }
    }
    return crc;
}

uint16_t Generate_Wakeup_Code(uint8_t *data, uint8_t len) {
    uint16_t code = 0xA5A5;
    uint8_t i;

    for (i = 0; i < len; i++) {
        code ^= (uint16_t)data[i] + 0x9B;
        code = (uint16_t)((code << 7) | (code >> 9));
        code += (uint16_t)(data[i] ^ (code >> 8));
    }

    code ^= 0x5A5A;
    return code;
}

void Simple_Crypt(uint8_t *data, uint8_t len) {
    uint8_t i;
    for (i = 0; i < len; i++) {
        // 1. encrypt XOR with  Secret_Key
        data[i] ^= Secret_Key[i % 8];

        // 2. use not to increase complexity
        data[i] = ~data[i];

     // 3. (option) prevent consecutive identical characters.
        data[i] ^= i;
    }
}

void Clock_Config(void)
{
	
	//enable internal HSI clock(16MHZ)
	CLK_HSICmd(ENABLE);

	//make sure internal clock(HSI) is stable
	while (CLK_GetFlagStatus(CLK_FLAG_HSIRDY) == RESET);

	//set HSI DIV(High speed internal clock prescaler: 1)
	CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
	CLK_PeripheralClockConfig(CLK_PERIPHERAL_SPI,   ENABLE);
    CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER2, ENABLE);

}

void Clear_PKE_EEPROM(void)
{
    uint8_t i;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);

    for (i = 0; i < 16; i++)
    {
        FLASH_ProgramByte(0x00004000 + i, 0x00);
    }

    FLASH_ProgramByte(0x00004100, 0x00);

    for (i = 0; i < 80; i++)
    {
        FLASH_ProgramByte(0x00004110 + i, 0x00);
    }

    FLASH_Lock(FLASH_MEMTYPE_DATA);
}

u8 Save_Combined_Key(uint8_t *rfid, uint8_t *rf433_full) {
    uint8_t num, i, k;
    uint16_t addr;
    uint8_t rfid_match, rf433_match,write_index;
    uint8_t existing_rfid[4];
    uint8_t existing_rf433[8];

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    num = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (num > MAX_KEY_NUM)
        num = 0;

    // --- first：check exist or not ---
    for (i = 0; i < num; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);

        rfid_match = 1;
        rf433_match = 1;

        // check RFID is exist or not(4 bytes)
        for (k = 0; k < 4; k++) {
            if (FLASH_ReadByte(addr + k) != rfid[k]) {
                rfid_match = 0;
                break;
            }
        }

        // check 433M is exist or not (8 bytes, 含 CRC)
        for (k = 0; k < 8; k++) {
            if (FLASH_ReadByte(addr + 4 + k) != rf433_full[k]) {
                rf433_match = 0;
                break;
            }
        }

        // if any of them exist, abandon the write operation
        if (rfid_match || rf433_match) {
            UART2_SendStr("Key already exists! Skip saving.");
            FLASH_Lock(FLASH_MEMTYPE_DATA);
            return 1;
        }
    }

    // --- 第二部分：確定不存在，執行寫入 ---
    // 這裡我們採用循環覆蓋邏輯，若 num=5 則從 0 開始存
    write_index = (num >= MAX_KEY_NUM) ? 0 : num;
    addr = KEY_DATA_START_ADDR + (write_index * KEY_BLOCK_SIZE);

    // 寫入 RFID
    for (k = 0; k < 4; k++) {
        FLASH_ProgramByte(addr + k, rfid[k]);
    }
    // 寫入 433MHz (含 CRC 共 10 bytes) 最後2byte是8byte raw key的crc也是新的喚醒碼
    for (k = 0; k < 10; k++) {
        FLASH_ProgramByte(addr + 4 + k, rf433_full[k]);
    }

    // 更新數量 (如果還沒滿才增加，滿了就維持 MAX_KEY_NUM)
    if (num < MAX_KEY_NUM) {
        FLASH_ProgramByte(KEY_COUNT_ADDR, num + 1);
    }

    FLASH_Lock(FLASH_MEMTYPE_DATA);
    UART2_SendStr("New Key saved successfully.");
    return 0;
}


/* 20ms pulse */
static void motor_turn_on(void)
{
    MOTOR_FWD();
    Delay_ms(20);
    MOTOR_STOP();
}

static void motor_turn_off(void)
{
    MOTOR_REV();
    Delay_ms(20);
    MOTOR_STOP();
}

