TJ215702/stm8/main.c
u8 Check_Combined_433M(uint8_t *target_rf433) {
    uint8_t i, k, match, num;
    uint16_t addr;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    num = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (num > MAX_KEY_NUM) num = MAX_KEY_NUM;

    for (i = 0; i < num; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);
        match = 1;
        // 從偏移量 +4 開始比對 8 bytes (含 CRC)
        for (k = 0; k < 8; k++) {
            if (FLASH_ReadByte(addr + 4 + k) != target_rf433[k]) {
                match = 0;
                break;
            }
        }
        if (match) {
            FLASH_Lock(FLASH_MEMTYPE_DATA);
            return 1;
        }
    }
    FLASH_Lock(FLASH_MEMTYPE_DATA);
    return 0;
}

u8 Check_Combined_RFID(uint8_t *target_rfid) {
    uint8_t i, k, match, num;
    uint16_t addr;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);
    num = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (num > MAX_KEY_NUM) num = MAX_KEY_NUM;

    for (i = 0; i < num; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);
        match = 1;
        // 從偏移量 +0 開始比對 4 bytes
        for (k = 0; k < 4; k++) {
            if (FLASH_ReadByte(addr + k) != target_rfid[k]) {
                match = 0;
                break;
            }
        }
        if (match) {
            FLASH_Lock(FLASH_MEMTYPE_DATA);
            return 1;
        }
    }
    FLASH_Lock(FLASH_MEMTYPE_DATA);
    return 0;
}

/* Load all keys from EEPROM to RAM cache before halt */
void Load_Keys_To_Cache(void) {
    uint8_t i, k;
    uint16_t addr;

    FLASH_Unlock(FLASH_MEMTYPE_DATA);

    /* Read key count */
    cached_key_count = FLASH_ReadByte(KEY_COUNT_ADDR);
    if (cached_key_count > MAX_KEY_NUM)
        cached_key_count = MAX_KEY_NUM;

    /* Load all keys (RFID + secure_key) to RAM */
    for (i = 0; i < cached_key_count; i++) {
        addr = KEY_DATA_START_ADDR + (i * KEY_BLOCK_SIZE);
        for (k = 0; k < KEY_BLOCK_SIZE; k++) {
            cached_keys[i][k] = FLASH_ReadByte(addr + k);
        }
    }

    FLASH_Lock(FLASH_MEMTYPE_DATA);
    UART2_SendStr("Keys loaded to RAM cache!");
}

/* Check 433M key against cached keys in RAM */
u8 Check_Combined_433M_Cached(uint8_t *target_rf433) {
    uint8_t i, k, match;

    for (i = 0; i < cached_key_count; i++) {
        match = 1;
        /* Compare from offset +4 (8 bytes of secure_key with CRC) */
        for (k = 0; k < 8; k++) {
            if (cached_keys[i][4 + k] != target_rf433[k]) {
                match = 0;
                break;
            }
        }
        if (match) {
            return 1;
        }
    }
    return 0;
}

static void GPIO_Config(void)
{

    GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST); /* D3 BR_LIGHT */
    GPIO_Init(GPIOB, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST); /* B3 LP_RIGHT */
    GPIO_Init(GPIOC, GPIO_PIN_2, GPIO_MODE_OUT_PP_LOW_FAST); /* Motor IN2 */
    GPIO_Init(GPIOB, GPIO_PIN_0, GPIO_MODE_OUT_PP_LOW_FAST); /* Motor IN1 */
    GPIO_Init(GPIOB, GPIO_PIN_1, GPIO_MODE_OUT_PP_LOW_FAST); /* BZ */

    GPIO_Init(GPIOB, GPIO_PIN_4, GPIO_MODE_IN_PU_IT);  //POWER KEY
    GPIO_Init(GPIOA, GPIO_PIN_2, GPIO_MODE_IN_FL_NO_IT); //LEARN KEY
    GPIO_Init(GPIOB, GPIO_PIN_5, GPIO_MODE_IN_FL_NO_IT); //IGN KEY

    GPIO_Init(GPIOD, GPIO_PIN_2, GPIO_MODE_OUT_PP_HIGH_FAST); //syn531 default disable
    GPIO_Init(GPIOD, GPIO_PIN_0, GPIO_MODE_IN_PU_NO_IT);    //RF DO
    GPIO_Init(GPIOE, GPIO_PIN_5, GPIO_MODE_OUT_PP_LOW_FAST);  //125k enable

    /* init gpio status */
    BR_LIGHT_OFF();
    LP_RIGHT_OFF();
    MOTOR_STOP();
    BZ_OFF();
    GPIO_WriteLow (GPIOD, GPIO_PIN_2);  //syn531 enable
}

/* ================= EXTI ================= */

static void EXTI_Config(void)
{
    /* PORTB rising edge */
    EXTI_SetExtIntSensitivity(EXTI_PORT_GPIOB,
                              EXTI_SENSITIVITY_RISE_ONLY);
}

/* ================= ISR ================= */

INTERRUPT_HANDLER(EXTI_PORTB_IRQHandler, 4)
{
    TJTW_PKE.power_event_flag = 1;
}

void TIM2_Init(void)
{
    TIM2_DeInit();
    TIM2_TimeBaseInit(TIM2_PRESCALER_16,100);   /* 0.1ms */
    TIM2_ITConfig(TIM2_IT_UPDATE , ENABLE);
    TIM2_OC2Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 0, TIM2_OCPOLARITY_HIGH);
    TIM2_OC2PreloadConfig(ENABLE);
    TIM2_SetCounter(0x0000);
    TIM2_Cmd(ENABLE);
		/* TIM2 IRQ13 highest priority (level 0) */
		ITC->ISPR4 &= (uint8_t)(~0x0C);
}


void RF_Remote(uint8_t level)
{
    unsigned char i;
    const char hex_chars[] = "0123456789ABCDEF";
    char hex_out[4];
    uint16_t received_crc, calculated_crc, final_crc;
    disableInterrupts();
    for (i = 0; i < 8; i++) {
        RF_UartSend[i] = Buff_B[i];
    }
    received_crc = ((uint16_t)RF_UartSend[6] << 8) | (uint16_t)RF_UartSend[7];
    calculated_crc = Calculate_CRC16(RF_UartSend, 6,level);

    RFFull = 0;
    if (level == 2) {
        /* POWER_ON: key should return secure key directly.
           Only validate and print received packet; do not derive again. */
        if (calculated_crc == received_crc ) {
            UART2_SendString("\r\nRF Data: ", 11);
            for (i = 0; i < 8; i++) {
                uint8_t val = RF_UartSend[i];
                hex_out[0] = hex_chars[(val >> 4) & 0x0F];
                hex_out[1] = hex_chars[val & 0x0F];
                hex_out[2] = ' ';
                UART2_SendString((unsigned char*)hex_out, 3);
            }
            RF_set = 1;
        } else {
            UART2_SendString("\r\nRF Data CRC/Header Error in POWER_ON! ", 40);
        }
    } else if (calculated_crc == received_crc && RF_UartSend[0] == 0x54 && RF_UartSend[1] == 0x4A) {
        RF_set = 1;
        UART2_SendString("\r\nRF Data: ", 11);
        for (i = 0; i < 8; i++) {
            uint8_t val = RF_UartSend[i];
            hex_out[0] = hex_chars[(val >> 4) & 0x0F];
            hex_out[1] = hex_chars[val & 0x0F];
            hex_out[2] = ' ';
            UART2_SendString((unsigned char*)hex_out, 3);
        }
        if(level ==1) {
            calculated_crc = Generate_Wakeup_Code(RF_UartSend, 8);
            RF_UartSend[8] = (uint8_t)(calculated_crc >> 8);   // wake-up code high
            RF_UartSend[9] = (uint8_t)(calculated_crc & 0xFF); // wake-up code low
            memcpy(secure_key, RF_UartSend, 6);
            Simple_Crypt(secure_key, 6);
            final_crc = Calculate_CRC16(secure_key, 6, 2);
            secure_key[6] = (uint8_t)(final_crc >> 8);
            secure_key[7] = (uint8_t)(final_crc & 0xFF);
            secure_key[8] = (uint8_t)(calculated_crc >> 8);   // wake-up code high
            secure_key[9] = (uint8_t)(calculated_crc & 0xFF); // wake-up code low

