TJ215702/stm8/main.c
        }

    } else {
        if (calculated_crc != received_crc) {
            UART2_SendString("\r\nRF Data CRC Error! ", 22);
        } else {
            UART2_SendString("\r\nRF Data Header Error! ", 23);
        }
    }
    enableInterrupts();
    UART2_SendString("\r\n", 2);
}


@far @interrupt void tim2_irqhandler(void)
{
    /* Clear TIM2 update interrupt flag */
    TIM2_ClearITPendingBit(TIM2_IT_UPDATE);

    /* -------------------------------------------------------------
     * Time base: 1 ms tick and 10 ms tick
     * ------------------------------------------------------------- */
    Time_1ms++;

    if (Time_1ms >= 10)
    {
        Time_1ms = 0;

        /* LF send timer countdown (clamp to 0) */
        if ((LF_ENABLE == 1) && (LF_Send_Tim > 0))
            LF_Send_Tim--;
        else
            LF_Send_Tim = 0;
    }

    /* If an RF frame is already captured, skip decoding */
    if (RFFull)
        return;

    /* -------------------------------------------------------------
     * RF OOK decoding:
     * - Measure LOW pulse width (LL_w) while RF_DATA is low
     * - On rising edge (LOW -> HIGH), interpret the LOW width
     * ------------------------------------------------------------- */
    if (RF_DATA_LOW())
    {
        /* Accumulate LOW width in ticks */
        LL_w++;
        RFBit = 0;   /* Mark current level as LOW */
    }
    else
    {
        /* Rising edge: process the LOW width that just ended */
        if (!RFBit)
        {
            if (!First_flag)
            {
                /* Detect sync/preamble LOW width */
               // if ((LL_w > 40) && (LL_w < 60))
							 if ((LL_w >= 35) && (LL_w <= 65)) // Relax the detection range of the sync header.
                {
                    First_flag = 1;
                    BitCount   = 0;
                    Buff_B[0] = Buff_B[1] = Buff_B[2] = 0;
                    Buff_B[3] = Buff_B[4] = Buff_B[5] = 0;
                    Buff_B[6] = Buff_B[7] = 0;
                }
            }
            else
            {
                /* Decode data bits by LOW width */
                //if ((LL_w > 3) && (LL_w <= 7))
								if ((LL_w >= 2) && (LL_w <= 7))  // Relax the lower limit of Bit 1 to 2 (enhance weak signal detection).
                {
                    /* Bit '1' */
                    if (BitCount < RF_LEN)
                    {
                        Buff_B[BitCount >> 3] <<= 1;
                        Buff_B[BitCount >> 3] |= 0x01;
                        BitCount++;
                    }
                }
                //else if ((LL_w >= 8) && (LL_w < 13))
								else if ((LL_w >= 8) && (LL_w <= 15)) // Relax the upper limit of Bit 0 to 15 (tolerate noise-extended waveforms)
                {
                    /* Bit '0' */
                    if (BitCount < RF_LEN)
                    {
                        Buff_B[BitCount >> 3] <<= 1;
                        BitCount++;
                    }
                }
                else
                {
                    /* Invalid width: reset decoder state */
                    First_flag = 0;
                    BitCount   = 0;
                }

                /* Frame complete */
                if (BitCount >= RF_LEN)
                {
                    BitCount   = 0;
                    First_flag = 0;
                    RFFull     = 1;
                }
            }

            /* Reset LOW width counter after processing */
            LL_w = 0;
        }

        RFBit = 1;   /* Mark current level as HIGH */
    }
}

void Handle_State_Wait(uint8_t *ign_wait)
{
    UART2_SendStr("PKE_OPER_STA_WAIT in!");

    if (IGN_IS_ON()) {
        /* Ignition ON: transition to IDLE */
        TJTW_PKE.oper_state = PKE_OPER_STA_IDLE;
        *ign_wait = 0;
        UART2_SendStr("IGN_ON PKE_OPER_STA_WAIT out!");
    } else {
        Delay_ms(1000);
        (*ign_wait)++;

        if (*ign_wait >= IGN_TIMEOUT_S) {
            /* Timeout reached: return to POWER_OFF immediately on the 10th second */
            TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
            *ign_wait = 0;
            motor_turn_off();
            UART2_SendStr("PKE_OPER_STA_WAIT out!");
        }
    }
}

void Handle_State_Idle(int *idle)
{
    if (*idle == 0) {
        UART2_SendStr("PKE_OPER_STA_IDLE in!");
        *idle = 1;
        TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
    }

    /* Blue light indicator */
    BR_LIGHT_ON();

    if (TJTW_PKE.power_event_flag) {
        /* Power OFF event */
        TJTW_PKE.power_event_flag = 0;
        motor_turn_off();
        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
        TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
        BR_LIGHT_OFF();
        UART2_SendStr("PKE_OPER_STA_IDLE out!");
        *idle = 0;
    } else if (!IGN_IS_ON()) {
        /* Ignition OFF event */
        motor_turn_off();
        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
        TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
        BR_LIGHT_OFF();
        UART2_SendStr("IGN_OFF PKE_OPER_STA_IDLE out!");
        *idle = 0;
    }
}

void Handle_State_Learn(void)
{
    int i;
    int ret = 0;
    uint8_t rfid_set = 0;
    unsigned char rc522_SN[4];

    UART2_SendStr("PKE_OPER_STA_LEARN in!");
    TIM2_Init();
    TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
    GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST);
    enableInterrupts();

    /* Attempt to read RFID card for 25 iterations */
    for (i = 0; i < 25; i++) {
        LP_RIGHT_ON();  /* Red light */
        BR_LIGHT_ON();  /* Blue light */
        Delay_ms(100);
        showcard(Tx_Buffer, &rfid_set, rc522_SN);
        Reset_RC522();
        if (rfid_set == 1) {
            UART2_SendString(Tx_Buffer, 17);
            i = 50;  /* Exit loop */
        }
        LP_RIGHT_OFF();
        BR_LIGHT_OFF();
        Delay_ms(100);
    }

    if (rfid_set == 1) {
        /* RFID card detected, now learn 433M key */
        UART2_SendStr("433m key learned!");
        i = 0;
        while (i < 16) {
            BR_LIGHT_ON();  /* Blue light */
            LF_SendData(0xc3, 0x3a, PATTREN_BIT, LF_SEND_CH1, 0x01, 0x01);
            Delay_ms(100);
            BR_LIGHT_OFF();
            Delay_ms(150);
            if (RFFull) {
                RF_Remote(1);
                UART2_SendStr("Get 433m key!");
                BR_LIGHT_OFF();
                break;
            }
            i++;
        }

