TJ215702/stm8/main.c
        if (RF_set == 1) {
            /* Both RFID and 433M keys received, save combined key */
            LF_SendData(0xc3, 0x3a, PATTREN_BIT, LF_SEND_CH1, RF_UartSend[8], RF_UartSend[9]);
            ret = Save_Combined_Key(rc522_SN, secure_key);
            if (ret > 0) {
                UART2_SendStr("Add 2 keys to eeprom failed!");
                LP_RIGHT_ON();
                Delay_ms(500);
                LP_RIGHT_OFF();
            } else {
                UART2_SendStr("Add 2 keys to eeprom!");
                Load_Keys_To_Cache();
            }
        } else {
            /* 433M key not received */
            UART2_SendStr("433m key not learned!");
            LP_RIGHT_ON();
            Delay_ms(500);
            LP_RIGHT_OFF();
        }
    } else {
        /* RFID card not detected */
        UART2_SendStr("RFID key not learned!");
        LP_RIGHT_ON();
        Delay_ms(500);
        LP_RIGHT_OFF();
    }

    RF_set = 0;
    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
    UART2_SendStr("PKE_OPER_STA_LEARN out!");
}

void Handle_State_Power_On(void)
{
    int i;
    int ret = 0;
    int wait_count = 0;
    uint8_t rfid_set = 0;
    unsigned char rc522_SN[4];

    UART2_SendStr("PKE_OPER_STA_POWER_ON in!");
    enableInterrupts();

    /* Step 1: Check RFID key (3 attempts) */
    UART2_SendStr("check RFID key!");
    for (i = 0; i < 3; i++) {
        Delay_ms(100);
        showcard(Tx_Buffer, &rfid_set, rc522_SN);
        Reset_RC522();
        if (rfid_set == 1) {
            UART2_SendString(Tx_Buffer, 17);
            rfid_set = 0;
            i = 50;  /* Exit loop */
            ret = Check_Combined_RFID(rc522_SN);
        }
    }

    /* Step 2: If RFID not matched, check 433M key */
    if (ret == 0) {
        UART2_SendStr("Check 433m key!");
        i = 0;
        wait_count = 0;

        while (i < cached_key_count) {
            while (wait_count < 6) {
                disableInterrupts();
                RFFull = 0;
                First_flag = 0;
                BitCount = 0;
                memset(Buff_B, 0, sizeof(Buff_B));
                enableInterrupts();

                /* Send LF command with wakeup code from cached key */
                LF_SendData(cached_keys[i][12], cached_keys[i][13], PATTREN_BIT, LF_SEND_CH1, 0x01, 0x01);

                /* Wait for RF response (max 350ms) */
                {
                    uint8_t delay_loop;
                    for (delay_loop = 0; delay_loop < 110; delay_loop++) {
                        Delay_ms(2);
                        if (RFFull) {
                            break;
                        }
                    }
                }

                /* Validate received RF data */
                if (RFFull) {
                    RF_Remote(2);
                    if (Check_Combined_433M_Cached(RF_UartSend)) {
                        UART2_SendStr("433m key matched!");
                        ret = 1;
                        wait_count = 10;  /* Exit inner loop */
                        break;
                    } else {
                        UART2_SendStr("433m key not matched or CRC error, retry...");
                        RFFull = 0;
                    }
                }
                wait_count++;
            }

            if (ret == 1) {
                break;  /* Exit outer loop */
            }
            wait_count = 0;
            i++;
        }
    }

    /* Step 3: Execute action based on validation result */
    if (ret == 1) {
        /* Key validation successful: unlock motor and transition to WAIT */
        motor_turn_on();
        TJTW_PKE.oper_state = PKE_OPER_STA_WAIT;
    } else {
        /* Key validation failed: flash red light and return to POWER_OFF */
        LP_RIGHT_ON();
        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
        Delay_ms(500);
        LP_RIGHT_OFF();
    }

    UART2_SendStr("PKE_OPER_STA_POWER_ON out!");
}
void Handle_State_Power_Off(void)
{
    UART2_SendStr("PKE_OPER_STA_POWER_OFF in!");
    enableInterrupts();

    /* Stop motor and prepare for halt */
    MOTOR_STOP();
    Delay_ms(50);
    motor_turn_off();
    halt();
    Delay_ms(50);

    /* Reinitialize peripherals after wake-up */
    Clock_Config();
    GPIO_Config();
    TIM4_Init();
    Uart_Init();
    InitRc522();
    Delay_ms(50);

    /* Check wake-up source and set next state */
    if (TJTW_PKE.power_event_flag) {
        TJTW_PKE.power_event_flag = 0;
        Load_Keys_To_Cache();

        if (GPIO_ReadInputPin(GPIOA, GPIO_PIN_2)) {
            /* LEARN key pressed: enter LEARN mode */
            TJTW_PKE.oper_state = PKE_OPER_STA_LEARN;
        } else {
            /* Normal power-on: enter POWER_ON mode */
            TJTW_PKE.oper_state = PKE_OPER_STA_POWER_ON;
        }
    }

    Uart_Init();
    UART2_SendStr("PKE_OPER_STA_POWER_OFF out!");
}


void main()
{
    int idle;
    uint8_t cfg_idx;
    uint8_t ign_wait = 0;

    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
    TJTW_PKE.power_event_flag = 0;
    TJTW_PKE.learn_event_flag = 0;
    idle=0;

    Clock_Config();
    GPIO_Config();
    EXTI_Config();
    TIM4_DeInit();
    TIM4_Init();
	//MX_TIM4_Init();
    Uart_Init();
    InitRc522();
    Delay_ms(100);
    //TIM2_PWM_Config();
    //Clear_PKE_EEPROM();

    LF_ClockOccurs(125);
    for (cfg_idx = 0; cfg_idx < MCU_REG_NUM; cfg_idx++) {
        Set_Buff[cfg_idx] = mcu_user_config[cfg_idx];
    }
    LF_PLL_SET(LF_PLL);

    Delay_InIt(16);
    TIM2_Init();   //need ro mask  TIM2_PWM_Config()
    enableInterrupts();
    /* Load all keys to RAM cache before entering main loop */
    Load_Keys_To_Cache();
		
    UART2_SendStr("system start!");
		
    while(1)
    {
        // LF_SendData(PATTERN1,PATTERN2,PATTREN_BIT,LF_SEND_CH1);
        // Delay_ms(250);
        // if (RFFull) {
        //     RF_Remote();
        // }
       
        switch(TJTW_PKE.oper_state) {
            case PKE_OPER_STA_POWER_OFF:
                Handle_State_Power_Off();
                break;
            case PKE_OPER_STA_POWER_ON:
                Handle_State_Power_On();
                break;
            case PKE_OPER_STA_WAIT:
                Handle_State_Wait(&ign_wait);
                break;
            case PKE_OPER_STA_IDLE:
                Handle_State_Idle(&idle);
                break;
            case PKE_OPER_STA_LEARN:
                Handle_State_Learn();
                break;
            default:
                UART2_SendStr("Default state");
                TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
                break;
        }

    }
}
